Unit/src/InformationRegisters/Unit_MockStates/Unit_MockStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Unit_MockStates</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Mock</name>
    <type>
      <types>CatalogRef.Unit_MockServiceData</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Unit/src/InformationRegisters/Unit_MockStates/ManagerModule.bsl
// @strict-types

#Region Public

// Set mock state.
// 
// Parameters:
//  Mock - CatalogRef.Unit_MockServiceData - Mock
//  Key - String - Key
//  Value - Arbitrary - Value
Procedure SetMockState(Mock, Key, Value) Export
	ValueString = "";
	If TypeOf(Value) = Type("String") Then
		ValueString = Value;
	ElsIf TypeOf(Value) = Type("Number") Then
		ValueString = Format(Value, "NZ=; NG=;");
	Else
		ValueString = String(Value);
	EndIf;
	
	RecordManager = CreateRecordManager();
	RecordManager.Period = CurrentDate();
	RecordManager.Mock = Mock;
	RecordManager.Key = Key;
	RecordManager.Value = ValueString;
	RecordManager.Write();
EndProcedure

Function GetMockState(Mock, Key) Export
	Filter = New Structure;
	Filter.Insert("Mock", Mock);
	Filter.Insert("Key", Key);
	
	Return GetLast(, Filter);
EndFunction

#EndRegion
